Documents/ЗаказыПользователейВК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказыПользователейВК</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UserID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/КорзинаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КорзинаПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Заказы/Ext/Module.bsl
Процедура ДобавитьВКорзину(Артикул, user_id) Экспорт  
	СтрокаID = Строка(user_id);
	
	// 1. Ищем существующую строку корзины
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|   Корзина.Ссылка КАК Ссылка
	|ИЗ
	|   Справочник.КорзинаПользователей КАК Корзина
	|ГДЕ
	|   Корзина.Пользователь = &Пользователь
	|   И Корзина.Артикул = &Артикул";

	Запрос.УстановитьПараметр("Пользователь", СтрокаID);
	Запрос.УстановитьПараметр("Артикул", Артикул);

	Результат = Запрос.Выполнить().Выбрать();

	Если Результат.Следующий() Тогда
	    // Если уже есть — увеличим количество
	    Элемент = Результат.Ссылка.ПолучитьОбъект();
	    Элемент.Количество = Элемент.Количество + 1;
	    Элемент.Записать();
	Иначе
	    // Если нет — создадим новый элемент
	    Элемент = Справочники.КорзинаПользователей.СоздатьЭлемент(); 
		//Гсч = Новый ГенераторСлучайныхЧисел();
		//Элемент.Код = Гсч.СлучайноеЧисло(10, 1000000);
		Элемент.Пользователь = СтрокаID;
	    Элемент.Артикул = Артикул;
	    Элемент.Количество = 1;
	    Элемент.Записать();
	КонецЕсли;
    
КонецПроцедуры      

// Процедура «Оформить заказ» — переносим всё из корзины в документ «ЗаказКлиента»
Процедура ОформитьЗаказДляПользователя(UserId) Экспорт
    // 1. Получаем все записи корзины
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Корзина.Артикул       КАК Артикул,
    |   Корзина.Количество    КАК Количество
    |ИЗ
    |   Справочник.КорзинаПользователей КАК Корзина
    |ГДЕ
    |   Корзина.Пользователь = &Пользователь";
    Запрос.УстановитьПараметр("Пользователь", UserId);

    Выборка = Запрос.Выполнить().Выбрать();

    // 2. Создаём документ «ЗаказКлиента»
    Заказ = Документы.ЗаказКлиента.СоздатьДокумент();
    // тут можно заполнить реквизиты заказа (дату, контрагента и т.п.)
    // Заказ.Дата       = ТекущаяДата();
    // Заказ.Контрагент = ...  

    Пока Выборка.Следующий() Цикл
        Строка = Заказ.Товары.Добавить();
        // Товар ищем по артикулу в справочнике
        Номенклатура = Справочники.Номенклатура.НайтиПоАртикулу(Выборка.Артикул);
        Если Не Номенклатура = Неопределено Тогда
            Строка.Номенклатура = Номенклатура;
            Строка.Количество   = Выборка.Количество;
        Иначе
            // можно обработать ситуацию «товар не найден»
        КонецЕсли;
    КонецЦикла;

    // 3. Записываем документ заказа
    Заказ.Записать();

    // 4. Очищаем корзину пользователя
    УдалитьЗаписиКорзины(UserId);

КонецПроцедуры

// Удалить все записи корзины для пользователя
Процедура УдалитьЗаписиКорзины(UserId)
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Корзина.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.КорзинаПользователей КАК Корзина
    |ГДЕ
    |   Корзина.Пользователь = &Пользователь";
    Запрос.УстановитьПараметр("Пользователь", UserId);

    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Справочники.КорзинаПользователей.Удалить(Выборка.Ссылка);
    КонецЦикла;
КонецПроцедуры  

Функция ПолучитьТекстКорзины(from_id) Экспорт 
    // 1. Собираем данные из справочника «КорзинаПользователей»
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Корзина.Артикул КАК Артикул,
    |   Корзина.Количество КАК Количество
    |ИЗ
    |   Справочник.КорзинаПользователей КАК Корзина
    |ГДЕ
    |   Корзина.Пользователь = &Пользователь";
    Запрос.УстановитьПараметр("Пользователь", Строка(from_id));
    
    Результат = Запрос.Выполнить().Выбрать();
    
    // 2. Подготовим переменные
    Текст           = "";
    КоличПозиций    = 0;
    ОбщаяСумма      = 0;
    
    // 3. Обходим результаты
    Пока Результат.Следующий() Цикл
        Если КоличПозиций = 0 Тогда
            // первая запись — формируем заголовок
            Текст = "У вас в корзине:" + Символы.ПС;
        КонецЕсли;
        
        Артикул = Результат.Артикул;
        Колво   = Результат.Количество;
		
        // Ищем саму номенклатуру
        Номенклатура = НайтиПоАртикулу(Артикул);
        Если Номенклатура = Неопределено Тогда
            Название = "[не найден товар]";     
		Иначе
            Название = Номенклатура.Наименование;
        КонецЕсли;
		
		КоличПозиций = КоличПозиций + 1;
        Цена         = Каталог.ПолучитьЦену(Номенклатура);
		Сумма        = Цена * Колво;
		ОбщаяСумма   = ОбщаяСумма + Сумма;
		
        // Добавляем строку с позицией
        Текст = Текст + Строка(КоличПозиций) + ". " + Название +
            " — " + Формат(Цена, "ЧДЦ=2") + "₽ х " + Строка(Колво) + " шт." + 
		    " = " + Формат(Сумма, "ЧДЦ=2") + Символы.ПС;
    КонецЦикла;
    
    // 4. Если не было ни одной записи
    Если КоличПозиций = 0 Тогда
        Возврат "Ваша корзина пуста.";
    КонецЕсли;
	
	Текст = Текст + Символы.ПС + Символы.ПС + 
	    "Общая сумма: " + Формат(ОбщаяСумма, "ЧДЦ=2") + "₽"; 
  
    Возврат Текст;
КонецФункции   

// Ищет в справочнике «Номенклатура» элемент по значению реквизита «Артикул».
// Если не найдено — возвращает Неопределено.
Функция НайтиПоАртикулу(Знач Артикул) Экспорт
    Если ЗначениеЗаполнено(Артикул) = Ложь Тогда 
        Возврат Неопределено;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Ном.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.Номенклатура КАК Ном
    |ГДЕ
    |   Ном.Артикул = &Артикул";
    Запрос.УстановитьПараметр("Артикул", Артикул);

    Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        Возврат Результат.Ссылка;
    КонецЕсли;

    Возврат Неопределено;
КонецФункции

Функция ПолучитьТекстЗаказов(from_id) Экспорт 
    // 1. Собираем данные из документов «ЗаказыПользователейВК»
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Заказ.Ссылка           КАК Ссылка,
    |   Заказ.Номер            КАК Номер,
    |   Заказ.Дата             КАК Дата,
	|   Заказ.Email            КАК Email,
	|   Заказ.Статус           КАК Статус
	|ИЗ
    |   Документ.ЗаказыПользователейВК КАК Заказ
    |ГДЕ
    |   Заказ.UserID = &Пользователь
    |УПОРЯДОЧИТЬ ПО
    |   Заказ.Дата УБЫВ";
    Запрос.УстановитьПараметр("Пользователь", Строка(from_id));
	Выборка = Запрос.Выполнить().Выбрать();

    // 2. Подготовим переменные
    Текст        = "";
    КоличЗаказов = 0;

    // 3. Обходим каждый найденный документ
    Пока Выборка.Следующий() Цикл
        КоличЗаказов = КоличЗаказов + 1;

        СсылкаДок  = Выборка.Ссылка;
        НомерДок   = Выборка.Номер;
        ДатаДок    = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");

        // Заголовок каждого заказа
        Если КоличЗаказов = 1 Тогда
            Текст = "Ваши заказы:" + Символы.ПС;
        КонецЕсли;

        Текст = Текст +
            Строка(КоличЗаказов) + ". Заказ №" + Строка(НомерДок) +
            " от " + ДатаДок + Символы.ПС;

        // 3.1. Состав заказа
        Док        = СсылкаДок.ПолучитьОбъект();
        ТабЧасть   = Док.СоставЗаказа;
        СуммаВсего = 0;

        Для каждого Стр Из ТабЧасть Цикл
            Назв  = Стр.Номенклатура.Наименование;
            Кол   = Стр.Количество;
            Цена  = ?(Стр.Цена <> Неопределено, Стр.Цена, 0);
            Подит = Цена * Кол;
            СуммаВсего = СуммаВсего + Подит;

            Текст = Текст +
                " • " + Назв +
                " — " + Строка(Кол) + " шт." +
                " × " + Формат(Цена, "ЧДЦ=2") + "₽" +
                " = " + Формат(Подит, "ЧДЦ=2") + "₽" + Символы.ПС;
        КонецЦикла;

        // 3.2. Итого по документу
        Текст = Текст +
            "Сумма заказа: " + Формат(СуммаВсего, "ЧДЦ=2") + "₽" + Символы.ПС + Символы.ПС;
    КонецЦикла;

    // 4. Если ни одного заказа не найдено
    Если КоличЗаказов = 0 Тогда
        Возврат "У вас нет оформленных заказов.";
    КонецЕсли;

    Возврат Текст;
КонецФункции
// 1. Создать заказ по корзине пользователя
Процедура СоздатьЗаказ(FromID, Email) Экспорт
    // 1.1. Получим из корзины массив структур { Артикул, Количество }
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Корзина.Артикул КАК Артикул,
    |   Корзина.Количество КАК Количество
    |ИЗ
    |   Справочник.КорзинаПользователей КАК Корзина
    |ГДЕ
    |   Корзина.Пользователь = &Пользователь";
    Запрос.УстановитьПараметр("Пользователь", Строка(FromID));
    Результат = Запрос.Выполнить().Выбрать();

    // Если корзина пуста — ничего не делаем
	Если НЕ Результат.Следующий() Тогда 
	Иначе
        // 1.2. Создаём сам документ
	    Док = Документы.ЗаказыПользователейВК.СоздатьДокумент();      // <- ваше имя документа
	    Док.Дата   = ТекущаяДата(); 
	    Док.UserID = FromID; // реквизит «Пользователь» у документа
        Док.Email  = Email;  
		Док.Статус = "В обработке";  
		
		ОбработатьСтрокуКорзины(Результат, Док);
	    // 1.3. Добавляем табличную часть "Товары"
	    Пока Результат.Следующий() Цикл         
			ОбработатьСтрокуКорзины(Результат, Док);	        
	    КонецЦикла;

	    // 1.4. Записываем документ
	    Док.Записать();

	    // 1.5. По желанию – очищаем корзину пользователя
	    ОчиститьКорзину(FromID);
    КонецЕсли;

КонецПроцедуры

Процедура ОбработатьСтрокуКорзины(Результат, Док)
	Артикул  = Результат.Артикул;
	Колво    = Результат.Количество;

	// Найдём ссылку на номенклатуру
	СсылкаНом = НайтиПоАртикулу(Артикул);
	Если СсылкаНом <> Неопределено Тогда
		Строка = Док.СоставЗаказа.Добавить();  // «Товары» – код табличной части
	    Строка.Номенклатура = СсылкаНом;
	    Строка.Количество   = Колво;   
		ЦенаТовара = Каталог.ПолучитьЦену(СсылкаНом);
        Строка.Цена = ЦенаТовара;   
		
	КонецЕсли;	
КонецПроцедуры

// 2. Утилита: очистить корзину
Процедура ОчиститьКорзину(FromID)
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Корзина.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.КорзинаПользователей КАК Корзина
    |ГДЕ
    |   Корзина.Пользователь = &Пользователь";
    Запрос.УстановитьПараметр("Пользователь", Строка(FromID));

    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        СсылкаЭлемента = Выборка.Ссылка;
		ОбъектЭлемента = СсылкаЭлемента.ПолучитьОбъект();
		ОбъектЭлемента.Удалить();
    КонецЦикла;
КонецПроцедуры
